'''
Напишите программу, которая умеет шифровать и расшифровывать шифр подстановки. Программа принимает на вход две строки одинаковой длины, 
на первой строке записаны символы исходного алфавита, на второй строке — символы конечного алфавита, после чего идёт строка, которую 
нужно зашифровать переданным ключом, и ещё одна строка, которую нужно расшифровать.

Пусть, например, на вход программе передано:
abcd
*d%#
abacabadaba
#*%*d*%


Это значит, что символ a исходного сообщения заменяется на символ * в шифре, b заменяется на d, c — на % и d — на #.
Нужно зашифровать строку abacabadaba и расшифровать строку #*%*d*% с помощью этого шифра. Получаем следующие строки, которые и передаём 
на вывод программы:
*d*%*d*#*d*
dacabac

Sample Input 1: 
abcd
*d%#
abacabadaba
#*%*d*%

Sample Output 1: 
*d*%*d*#*d*
dacabac

'''

code_dict = {}
st = input()
code = input()
st_for_code = input()
code_st = input()
for i in range(len(st)):
    code_dict[st[i]] = code[i]
for i in st_for_code:
    print(code_dict[i], end = '')
print()
for i in code_st:
    for key, value in code_dict.items():
        if value == i:
            print(key, end = '')
            break
